#!/usr/bin/python3
# -*-coding:utf-8-*-
# author: https://blog.csdn.net/zhongqi2513

# ====================================================
# 内容描述： 数据类型 --- List类型
# ====================================================

"""
## 通过观察结果发现：
1、tuple (元组) 使用小括号
2、list (列表)  使用中括号
3、set  (集合)  使用大括号
4、dict (字典)  使用大括号
   dict 也是无序的，只不过 dict 保存的是 key-value 键值对值，而 set 可以理解为只保存 key 值。
"""

import copy

# Python 内置的一种数据类型是列表：list。 list 是一种有序的集合，可以随时添加和删除其中的元素。
# 创建一个列表，只要把逗号分隔的不同的数据项使用方括号括起来即可，且列表的数据项不需要具有相同的类型


# 定义 list
l1 = list((1, 2, 3, 4, 5))
l2 = list(["huangbo", 'xuzheng', 1234, 55.55])
l3 = ["huangbo", 'xuzheng', 1234, 55.55]

print("---------------------------1-----------------------------")
# 访问list
print(l3[0])
print(type(l3[0]))
print(l3[1])
print(type(l3[1]))
print(l3[2])
print(type(l3[2]))
print(l3[3])
print(type(l3[3]))

print("---------------------------2-----------------------------")
# list切片
print(l3[1:4])
print(l3[2:3])

print("---------------------------3-----------------------------")
# 更新list
print(l3)
l3[1] = "wangbaoqiang"
print(l3)
l3.append("xuzheng")
print(l3)

print("---------------------------4-----------------------------")
# 删除list
print(l3)
del l3[2]
print(l3)

print("---------------------------5-----------------------------")
# list运算符
print(len([1, 2, 3, 4, 5, 6, 7, 8, 9]))
l4 = [1, 2, 3] + [4, 5, 6]
print(l4)
print(l4 * 4)
print(4 in l4)
print(7 in l4)

print("---------------------------6-----------------------------")
# 复制一个list
list22 = [1, 2, "A", 4.44, 3 + 4j]
list33 = list22[:]
print(list22, list33, sep="\n")

print("---------------------------7-----------------------------")
# list遍历
for x in l4:
    print(x, end=" ")
print()
