#!/usr/bin/python3
# -*- coding:utf-8 -*-
# author: 马中华 https://blog.csdn.net/zhongqi2513

# ====================================================
# 内容描述： 
# ====================================================

# 条件语句和循环语句综合实例

"""
有 while … else 语句，当然也有 for … else 语句啦，for 中的语句和普通的没有区别，
else 中的语句会在循环正常执行完（即 for 不是通过 break 跳出而中断的）的情况下执行，while … else 也是一样。
"""
for num in range(10, 20):  # 迭代 10 到 20 之间的数字
    for i in range(2, num):  # 根据因子迭代
        if num % i == 0:  # 确定是否能除尽，能除尽，则表示是合数
            print('%d 是一个合数' % num)
            break  # 跳出当前循环
    else:  # 循环的 else 部分
        print('%d 是一个质数' % num)

print("---------------------------------1---------------------------------")
# for ... else ... 的用途
A = [[1, 2, 3, 4, 2, 66],
     [1, 0, 2, 32, -9, 3, 4, 1, 2],
     [7, 8, 9, 3, 2, 2],
     [2, -3, 3, 1, 1, 3, 21]]
# 上面这个矩阵， 求出全是正数的行的编号...

for a in A:
    ok = True
    for x in a:
        if x <= 0:  # 一旦发现存在负数，则记录ok变量并退出本层循环
            ok = False
            break
    if ok:
        print('第', A.index(a), '行全是正数')

print("---------------------------------2---------------------------------")
print("for ... else ...")
for a in A:
    for x in a:
        if x <= 0:
            break
    else:  # 能执行到这一句说明上面的循环完整执行了，没有break
        print('第', A.index(a), '行全是正数')
